🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / Test Template-10288](https://app.env0.com/p/d3a9ee14-cfea-4b29-907a-9b89e281d41d/environments/e122bfec-1311-40b2-8ddf-f1de5a2b64e5):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # aws_iam_role.test_role will be created
+   resource "aws_iam_role" "test_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "test_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>

```
Monthly cost change for gl-amagana/env0-spike/.env0workdir/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Project: gl-amagana/env0-spike/.env0workdir/.tf-plan

Monthly cost change for gl-amagana/env0-spike/.env0workdir/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

----------------------------------
Key: ~ changed, + added, - removed

No changes detected. Run infracost breakdown to see the full breakdown.
```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/d3a9ee14-cfea-4b29-907a-9b89e281d41d/environments/e122bfec-1311-40b2-8ddf-f1de5a2b64e5/deployments/ccb72dc7-fdc5-4c89-81b2-18dfab864451)